LC4WithExtensionFilled/0/U
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
FoamFile
{
    version     2.0;
    format      binary;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    atmosphere
    {
        type            pressureInletOutletVelocity; // Alternativ: fluxCorrectedVelocity,  pressureNormalInletOutletVelocity, ...
        value           uniform (0 0 0);
    }
    defaultFaces
    {
        type            slip;
    }
    gate
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    inlet
    {
        // Computes the velocity that is needed for a certain flowrate
        type            flowRateWaterVelocity;
        flowRateWater 0.01852;        // Constant rate [m³/s]
        
        // Flowrate can be variable in time by giving a table  ([s] [m³/s]):
        // flowRateWater   table (
        //                  (0.0  482.5)    
        //                  (20.0  600.)
        //                  (60.0   0.0)   
        //                );                      

        // ADVANCED ENTRIES:
        // relaxationTime 0.0;        // Relaxation time, set to Eigenperiod of upstream waves if wavy surface is observed.
        alphaLowerThreshold  0.001;   // Allow flow for cells with alpha.water < 0.001
        alphaUpperThreshold  0.999;   // Allow flow for cells with alpha.water > 0.999

        // Initialise [m/s][m/s][m/s]
        value           uniform (0. 0. 0.); 
    }
    lowerWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    outlet
    {
        type            pressureInletOutletVelocity; // Alternativ: fluxCorrectedVelocity,  pressureNormalInletOutletVelocity, ...
        value           uniform (0 0 0);
    }
}
