LC4WithExtensionFilled/0/blueprints/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  BAW-Blaupause                         |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

/*
    Einlauf: Vorgegebener Volumenstrom: calculated
    Auslauf: Vorgegebener Wasserstand (am Auslauf): calculated
    Wand: nutkRoughWallFunction (Vorgabe einer Sandrauheit) oder calculated (slip)

    Wenn unklar: calculated

    ACHTUNG: Den "Deckel" wie vorgegebenen Wasserstand behandeln, wenn er offen sein soll (sonst als Wand)!
*/

boundaryField
{
    xmin
    {
        type            calculated;
        value           uniform 0;
    }
    
    xmax
    {
        type            calculated;
        value           uniform 0;
    }
    
    ymin
    {
        type            calculated;
        value           uniform 0;
    }
    
    ymax
    {
        type            calculated;
        value           uniform 0;
    }
    
    zmin
    {
        type            calculated;
        value           uniform 0;
    }
    
    zmax
    {
        type            calculated;
        value           uniform 0;
    }
    
    pfeiler
    {
        type            nutkRoughWallFunction;
        Ks              uniform 0.005;  // roughness height = sand-grain roughness (0 for smooth walls), in m
        Cs              uniform 0.5;    // roughness constant, default 0.5
        value           uniform 0.0;
    }
    
    "sohle_.*"
    {
        type            nutkRoughWallFunction;
        Ks              uniform 0.005;  // roughness height = sand-grain roughness (0 for smooth walls), in m
        Cs              uniform 0.5;    // roughness constant, default 0.5
        value           uniform 0.0;
    }
      

    // Wird nach Gitter-Manipulationen oft gebraucht!
    oldInternalFaces
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
